IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/RTC_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="RTC" HW_revision="1.0">
    <register id="RTC_FPUB_0" width="32" offset="0x444" description="Publisher Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <group id="RTC_GPRCM" name="RTC_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="RTC_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="RTC_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="RTC_CLKCFG" width="32" offset="0x8" description="Peripheral Clock Configuration Register">
            <bitfield id="BLOCKASYNC" description="Async Clock Request is blocked from starting SYSOSC or forcing bus clock to 32MHz" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Not block async clock request"/>
                <bitenum id="ENABLE" value="0x1" description="Block async clock request"/>
            </bitfield>
        </register>
        <register id="RTC_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <register id="RTC_CLKSEL" width="32" offset="0x1004" description="Clock Select for Ultra Low Power peripherals">
        <bitfield id="LFCLK_SEL" description="Selects LFCLK as clock source if enabled" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="LFCLK is disabled as clock source"/>
            <bitenum id="ENABLE" value="0x1" description="LFCLK is enabled as clock source"/>
        </bitfield>
    </register>
    <group id="RTC_INT_EVENT0" name="RTC_INT_EVENT0" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="RTC_INT_EVENT0_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTCRDY" value="0x1" description="RTC-Ready interrupt; Interrupt flag: RTCRDY"/>
                <bitenum id="RTCTEV" value="0x2" description="Time-Event interrupt; Interrupt flag: RTCTEV"/>
                <bitenum id="RTCA1" value="0x3" description="Alarm-1 interrupt; Interrupt flag: RTCA1"/>
                <bitenum id="RTCA2" value="0x4" description="Alarm-2 interrupt; Interrupt flag: RTCA2"/>
                <bitenum id="RT0PS" value="0x5" description="Prescaler-0 interrupt; Interrupt flag: RT0PS"/>
                <bitenum id="RT1PS" value="0x6" description="Prescaler-1 interrupt; Interrupt flag: RT1PS"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RTCA2" description="Enable Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT0PS" description="Enable Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT1PS" description="Enable Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Enable Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCRDY" description="Enable RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA1" description="Enable Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT0_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RTCRDY" description="Raw RTC-Ready interrupts status" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Raw Time-Event interrupt status" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA1" description="Raw Alarm-1 interrupt status" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA2" description="Raw Alarm-2 interrupts status" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT0PS" description="Raw Prescaler-0 interrupt status" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT1PS" description="Raw Prescaler-1 interrupt status" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT0_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RTCRDY" description="Masked RTC-Ready interrupt status" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Masked Time-Event interrupt status" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA1" description="Masked Alarm-1 interrupt status" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA2" description="Masked Alarm-2 interrupt status" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT0PS" description="Masked Prescaler-0 interrupt status" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT1PS" description="Masked Prescaler-1 interrupt status" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RTCRDY" description="Set RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Set Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCA1" description="Set Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCA2" description="Set Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RT0PS" description="Set Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RT1PS" description="Set Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT0_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RTCRDY" description="Clear RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Clear Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTCA1" description="Clear Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTCA2" description="Clear Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RT0PS" description="Clear Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RT1PS" description="Clear Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
