IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/RTC_1.0.xml
    </group>
    <group id="RTC_INT_EVENT1" name="RTC_INT_EVENT1" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="RTC_INT_EVENT1_IIDX" width="32" offset="0x0" description="Interrupt Index Register">
            <bitfield id="STAT" description="Interrupt index status" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No interrupt pending"/>
                <bitenum id="RTCRDY" value="0x1" description="RTC-Ready interrupt; Interrupt flag: RTCRDY"/>
                <bitenum id="RTCTEV" value="0x2" description="Time-Event interrupt; Interrupt flag: RTCTEV"/>
                <bitenum id="RTCA1" value="0x3" description="Alarm-1 interrupt; Interrupt flag: RTCA1"/>
                <bitenum id="RTCA2" value="0x4" description="Alarm-2 interrupt; Interrupt flag: RTCA2"/>
                <bitenum id="RT0PS" value="0x5" description="Prescaler-0 interrupt; Interrupt flag: RT0PS"/>
                <bitenum id="RT1PS" value="0x6" description="Prescaler-1 interrupt; Interrupt flag: RT1PS"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RTCA2" description="Enable Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT0PS" description="Enable Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT1PS" description="Enable Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Enable Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCRDY" description="Enable RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA1" description="Enable Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RTCRDY" description="Raw RTC-Ready interrupts status" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Raw Time-Event interrupt status" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA1" description="Raw Alarm-1 interrupt status" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA2" description="Raw Alarm-2 interrupts status" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT0PS" description="Raw Prescaler-0 interrupt status" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT1PS" description="Raw Prescaler-1 interrupt status" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RTCRDY" description="Masked RTC-Ready interrupt status" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Masked Time-Event interrupt status" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA1" description="Masked Alarm-1 interrupt status" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RTCA2" description="Masked Alarm-2 interrupt status" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT0PS" description="Masked Prescaler-0 interrupt status" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
            <bitfield id="RT1PS" description="Masked Prescaler-1 interrupt status" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                <bitenum id="SET" value="0x1" description="Interrupt occured"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RTCRDY" description="Set RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Set Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCA1" description="Set Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RTCA2" description="Set Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RT0PS" description="Set Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
            <bitfield id="RT1PS" description="Set Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt"/>
            </bitfield>
        </register>
        <register id="RTC_INT_EVENT1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RTCRDY" description="Clear RTC-Ready interrupt" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="RTCTEV" description="Clear Time-Event interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA1" description="Clear Alarm-1 interrupt" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RTCA2" description="Clear Alarm-2 interrupt" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT0PS" description="Clear Prescaler-0 interrupt" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
            <bitfield id="RT1PS" description="Clear Prescaler-1 interrupt" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrrupt Mask"/>
            </bitfield>
        </register>
