IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/RTC_1.0.xml
    </group>
    <register id="RTC_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode 0 select" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. The software ISR clears the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode 1 select" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. The software ISR clears the associated RIS flag."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="RTC_DESC" width="32" offset="0x10FC" description="RTC Descriptor Register">
        <bitfield id="MINREV" description="Minor revision. This number holds the module revision and is incremented by the module developers. n = Minor module revision (see device-specific data sheet)" begin="3" end="0" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major revision. This number holds the module revision and is incremented by the module developers. n = Major version (see device-specific data sheet)" begin="7" end="4" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instantiated version. Describes which instance of the module accessed." begin="11" end="8" width="4" rwaccess="R">
            <bitenum id="INST0" value="0x0" description="This is the default, if there is only one instance - like for SSIM"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature set of this module. Differentiates the complexity of the actually instantiated module if there are differences." begin="15" end="12" width="4" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Maximum value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identifier. This ID is unique for each module. 0x0911 = Module ID of the RTC Module" begin="31" end="16" width="16" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Maximum value"/>
        </bitfield>
    </register>
    <register id="RTC_CLKCTL" width="32" offset="0x1100" description="RTC Clock Control Register">
        <bitfield id="MODCLKEN" description="This bit enables the supply of the 32kHz clock to the RTC. It will not power-up the 32kHz crystal oscillator this needs to be done in the Clock System Module." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="32kHz clock is not supplied to the RTC."/>
            <bitenum id="ENABLE" value="0x1" description="32kHz clock is supplied to the RTC."/>
        </bitfield>
    </register>
    <register id="RTC_DBGCTL" width="32" offset="0x1104" description="RTC Module Debug Control Register">
        <bitfield id="DBGRUN" description="Debug Run." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="HALT" value="0x0" description="Counter is halted if CPU is in debug state."/>
            <bitenum id="RUN" value="0x1" description="Continue to operate normally ignoring the debug state of the CPU."/>
        </bitfield>
        <bitfield id="DBGINT" description="Debug Interrupt Enable." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Interrupts of the module will not be captured anymore if CPU is in debug state. Which means no update to the RTCRIS, RTCMISC and RTCIIDX register."/>
            <bitenum id="ON" value="0x1" description="Interrupts are enabled in debug mode. Interrupt requests are signaled to the interrupt controller. If the flags are required by software (polling mode) the DGBINT bit need to be set to 1."/>
        </bitfield>
    </register>
    <register id="RTC_CTL" width="32" offset="0x1108" description="RTC Control Register">
        <bitfield id="RTCTEVTX" description="Real-time clock time event." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="MINUTE" value="0x0" description="Minute changed."/>
            <bitenum id="HOUR" value="0x1" description="Hour changed."/>
            <bitenum id="MIDNIGHT" value="0x2" description="Every day at midnight (00:00)."/>
            <bitenum id="NOON" value="0x3" description="Every day at noon (12:00)."/>
        </bitfield>
        <bitfield id="RTCBCD" description="Real-time clock BCD select. Selects BCD counting for real-time clock." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="BINARY" value="0x0" description="Binary code selected"/>
            <bitenum id="BCD" value="0x1" description="Binary coded decimal (BCD) code selected"/>
        </bitfield>
    </register>
    <register id="RTC_STA" width="32" offset="0x110C" description="RTC Status Register">
        <bitfield id="RTCRDY" description="Real-time clock ready. This bit indicates when the real-time clock time values are safe for reading." begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="RTC time values in transition"/>
            <bitenum id="READY" value="0x1" description="RTC time values safe for reading"/>
        </bitfield>
        <bitfield id="RTCTCRDY" description="Real-time clock temperature compensation ready. This is a read only bit that indicates when the RTCTCMPx can be written. Write to RTCTCMPx should be avoided when RTCTCRDY is reset." begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Real-time clock temperature compensation not ready"/>
            <bitenum id="READY" value="0x1" description="Real-time clock temperature compensation ready"/>
        </bitfield>
        <bitfield id="RTCTCOK" description="Real-time clock temperature compensation write OK. This is a read-only bit that indicates if the write to RTCTCMP is successful or not." begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="NOT_OK" value="0x0" description="Write to RTCTCMPx is unsuccessful"/>
            <bitenum id="OK" value="0x1" description="Write to RTCTCMPx is successful"/>
        </bitfield>
    </register>
    <register id="RTC_CAL" width="32" offset="0x1110" description="RTC Clock Offset Calibration Register">
        <bitfield id="RTCOCALX" description="Real-time clock offset error calibration. Each LSB represents approximately +1ppm (RTCOCALXS = 1) or -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm will be ignored by hardware." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum effective calibration value."/>
            <bitenum id="MAXIMUM" value="0xFF" description="Maximum effective calibration value is +/-240ppm. Excess values written above +/-240ppm will be ignored by hardware."/>
        </bitfield>
        <bitfield id="RTCOCALS" description="Real-time clock offset error calibration sign. This bit decides the sign of offset error calibration." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DOWN" value="0x0" description="Down calibration. Frequency adjusted down."/>
            <bitenum id="UP" value="0x1" description="Up calibration. Frequency adjusted up."/>
        </bitfield>
        <bitfield id="RTCCALFX" description="Real-time clock calibration frequency. Selects frequency output to RTC_OUT pin for calibration measurement. The corresponding port must be configured for the peripheral module function." begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="No frequency output to RTC_OUT pin"/>
            <bitenum id="F512HZ" value="0x1" description="512 Hz"/>
            <bitenum id="F256HZ" value="0x2" description="256 Hz"/>
            <bitenum id="F1HZ" value="0x3" description="1 Hz"/>
        </bitfield>
    </register>
