IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/RTC_1.0.xml
    <register id="RTC_A1HOUR" width="32" offset="0x1134" description="RTC Hours Alarm Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="AHOURBIN" description="Alarm Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x17" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURAEBIN" description="Alarm Hours Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="AHOURLOWBCD" description="Alarm Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURHIGHBCD" description="Alarm Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0.." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x2" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURAEBCD" description="Alarm Hours BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
    <register id="RTC_A1DAY" width="32" offset="0x1138" description="RTC Alarm Day Of Week / Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="ADOW" description="Alarm Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x6" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOWAE" description="Alarm Day of week enable. This bit are valid if RTCBCD=1 or RTCBCD=0." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMBIN" description="Alarm Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="12" end="8" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMAEBIN" description="Alarm Day of month Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMLOWBCD" description="Alarm Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMHIGHBCD" description="Alarm Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x3" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMAEBCD" description="Alarm Day of month BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
    <register id="RTC_A2MIN" width="32" offset="0x113C" description="RTC Minute Alarm Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="AMINBIN" description="Alarm Minutes Binary (0 to 59). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="5" end="0" width="6" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x3B" description="Maximum value"/>
        </bitfield>
        <bitfield id="AMINAEBIN" description="Alarm Minutes Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="AMINLOWBCD" description="Alarm Minutes BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Maximum value"/>
        </bitfield>
        <bitfield id="AMINHIGHBCD" description="Alarm Minutes BCD  high digit (0 to 5). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="14" end="12" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x5" description="Maximum value"/>
        </bitfield>
        <bitfield id="AMINAEBCD" description="Alarm Minutes BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
