IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/RTC_1.0.xml
    <register id="RTC_A2HOUR" width="32" offset="0x1140" description="RTC Hours Alarm Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="AHOURBIN" description="Alarm Hours Binary (0 to 23). If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="4" end="0" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x17" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURAEBIN" description="Alarm Hours Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="AHOURLOWBCD" description="Alarm Hours BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURHIGHBCD" description="Alarm Hours BCD  high digit (0 to 2). If RTCBCD=0 write to these bits will be ignored and read give the value 0.." begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x2" description="Maximum value"/>
        </bitfield>
        <bitfield id="AHOURAEBCD" description="Alarm Hours BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
    <register id="RTC_A2DAY" width="32" offset="0x1144" description="RTC Alarm Day Of Week / Month Register - Calendar Mode With Binary / BCD Format">
        <bitfield id="ADOW" description="Alarm Day of week (0 to 6). These bits are valid if RTCBCD=1 or RTCBCD=0." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x6" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOWAE" description="Alarm Day of week enable. This bit are valid if RTCBCD=1 or RTCBCD=0." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMBIN" description="Alarm Day of month Binary (1 to 28, 29, 30, 31) If RTCBCD=1 write to these bits will be ignored and read give the value 0." begin="12" end="8" width="5" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x1F" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMAEBIN" description="Alarm Day of month Binary enable. If RTCBCD=1 this bit is always 0. Write to this bit will be ignored." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
        <bitfield id="ADOMLOWBCD" description="Alarm Day of month BCD  low digit (0 to 9). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x9" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMHIGHBCD" description="Alarm Day of month BCD  high digit (0 to 3). If RTCBCD=0 write to these bits will be ignored and read give the value 0." begin="21" end="20" width="2" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
            <bitenum id="MAXIMUM" value="0x3" description="Maximum value"/>
        </bitfield>
        <bitfield id="ADOMAEBCD" description="Alarm Day of month BCD enable. If RTCBCD=0 this bit is always 0. Write to this bit will be ignored." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Alarm disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Alarm enabled"/>
        </bitfield>
    </register>
    <register id="RTC_PSCTL" width="32" offset="0x1148" description="RTC Prescale Timer 0/1 Control Register">
        <bitfield id="RT0IP" description="Prescale timer 0 interrupt interval" begin="4" end="2" width="3" rwaccess="R/W">
            <bitenum id="DIV8" value="0x2" description="Divide by 8 - 244 microsecond interval"/>
            <bitenum id="DIV16" value="0x3" description="Divide by 16  - 488 microsecond interval"/>
            <bitenum id="DIV32" value="0x4" description="Divide by 32 - 976 microsecond interval"/>
            <bitenum id="DIV64" value="0x5" description="Divide by 64 - 1.95 millisecond interval"/>
            <bitenum id="DIV128" value="0x6" description="Divide by 128 - 3.90 millisecond interval"/>
            <bitenum id="DIV256" value="0x7" description="Divide by 256 - 7.81 millisecond interval"/>
        </bitfield>
        <bitfield id="RT1IP" description="Prescale timer 1 interrupt interval" begin="20" end="18" width="3" rwaccess="R/W">
            <bitenum id="DIV2" value="0x0" description="Divide by 2 - 15.6 millisecond interval"/>
            <bitenum id="DIV4" value="0x1" description="Divide by 4 - 31.2 millisecond interval"/>
            <bitenum id="DIV8" value="0x2" description="Divide by 8 - 62.5 millisecond interval"/>
            <bitenum id="DIV16" value="0x3" description="Divide by 16 - 125 millisecond interval"/>
            <bitenum id="DIV32" value="0x4" description="Divide by 32 - 250 millisecond interval"/>
            <bitenum id="DIV64" value="0x5" description="Divide by 64 - 500 millisecond interval"/>
            <bitenum id="DIV128" value="0x6" description="Divide by 128 - 1 second interval"/>
            <bitenum id="DIV256" value="0x7" description="Divide by 256 - 2 second interval"/>
        </bitfield>
    </register>
</module>
